Repository: mozilla-l10n/mt-training-data
Catalog: so/so_pontoon.tmx
Source language: en_us
Languages: so

source: About
so: Ku saabsan

source: Add Your Voice
so: Kudar Codkaaga

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
so: Sawaxan gadaaleed daggan waa OK, balse ma doonayno codad dheeraad ah oo sababi kara algorithm-ka mashiinka inuu u u maleeyo ereyo aan ku jirin qoraalka inay ku jiraan. Haddii aad maqasho ereyo gaar ah oo ka duwan kuwa qoraalka, codkaas waa in la diidaa. Caadi ahaan tani waxay dhacdaa marka TV daaran yahay, ama meesha lagu sheekaysanayo.

source: Are you coming? <strong>[called by another]</strong>
so: Ma imanaysaa? <strong>[mid kalaa yiri]</strong>

source: Background Noise
so: Guux gadaaleed

source: Background Voices
so: Sawaxanka gadaal

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
so: Ka digtoonow ka hor inta aanad diidin cod akhristuhu kelmad si khaldan ugu dhawaaqay, culayska saaray (shaday) meel qaldan, ama sida muuqata uu iska indho-tiray calaamad su’aal. Waxaa jira dhawaaqyo badan oo kala duwan oo adduunka laga isticmaalo, kuwaas oo qaarkood laga yaabo inaadan ku maqlin bulshada deegaankaaga. Fadlan qaddari dadka u hadla si ka duwan qaabkaaga.

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
so: ['Beret' waa sax haddii ku dhawaaqidda xoogga lasaaro (la shado) xarafka koowaad (UK) ama kan labaad (US)]

source: <bold>{ $count }</bold> Clips
so: <bold>{ $count }</bold> Codad

source: <bold>Help us</bold> find more voices
so: <bold>Nagu caawi</bold> n aan helno codad dheeraad ah

source: Change preferences
so: Beddel dookhyada

source: <chevron></chevron>See less
so: <chevron></chevron>wax yar eeg

source: <chevron></chevron>See more
so: <chevron></chevron>Waxdheeraada eeg

source: Click
so: Guji

source: Comment
so: Faallo

source: Continue
so: Sii wad

source: Contribute
so: Ka qayb qaado

source: Contribute sentences
so: Kaga qeyb qaado weedho

source: Contribution Criteria
so: Shuruudaha/ halbeegyada wax ku biirinta

source: Criteria
so: Halbeegyo

source: Datasets
so: Xirmo xog

source: Different language
so: Luuqad ka duwan

source: Difficult to pronounce
so: Way adag tahay in lagu dhawaaqo

source: Discard ongoing recording
so: Tuur duubista socota

source: Don't see your language on Common Voice yet?
so: Weli Kuma aadan arag luqadaada Common Voice miyaa?

source: for example
so: tusaale ahaan

source: Grammatical / spelling error
so: Khalad naxwe / higaad

source: Help create Common Voice’s first target segment in { $locale }
so: Nagu Caawi abuurista qaybta bartilmaameedka koowaad ee Common Voice ee { $locale }

source: His hand was rais-ed.
so: Gacantiisa kor baa loo qaaday.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
so: Haddii duubistu kala go'do, ama ay leedahay jabaqyo, iska diid ilaa in qoraalka oo dhan la wada maqli karo maahee.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
so: Haddii aad la kulanto wax aanay hagayaashan tilmaamayn, fadlan u codee si waafaqsan qiyaastaada ugu fiican. Haddii aadan go'aan gaari karinna, isticmaal badhanka skip "ka gudub" una gudub duubista xigta.

source: It contains words or phrases that are hard to read or pronounce.
so: Waxaa ku jira erayo ama weedho ay adag tahay in la akhriyo ama lagu dhawaaqo.

source: It is written in a language different than what I’m speaking.
so: Waxaa lagu qoray luqad ka duwan midda aan ku hadlayo.

source: Just Unsure?
so: Waadan hubtid uun miyaa?

source: Keep track of your progress with a profile
so: La soco horumarkaaga adiga oo adeegsanaya profile

source: Languages
so: Luuqado

source: Learn More
so: Sii baro wax dheeraad ah

source: Log in or sign up to get started
so: Soo gal ama is diiwaan geli si aad u bilowdo

source: Log In / Sign Up
so: Soo gal / Is diiwaan gali

source: [Mismatched content]
so: [Xog aan is-waafaqsanayn]

source: Misreadings
so: Akhris qaldan

source: Missing an <strong>'s'</strong> at the end of a word.
so: Waxaa ka maqan <strong>'s' </strong> dhamaadka erey.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
so: Waxaa ka maqan <strong>'A'</strong>ama <strong>' The'</strong>bilowga duubista.

source: Missing the end of the last word by cutting off the recording too quickly.
so: Maqan dhamaadka ereyga u dambeeya iyadoo loo joojiyay duubista si degdeg ah.

source: [More has been recorded than the required text]
so: [In ka badan ayaa la duubay qoraalka loo baahan yahay]

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
so: Inta badan duubitaannada waa dad ku hadlaya codkooda dabiiciga ah. Waad aqbali kartaa duubista dhifta ah ee khilaafsan halbeegga caadiga a ee la qeylinayo, ama si saa'id ah hoos loogu hadlayo, ama cod ka 'badbadis' loogu gudbinayo cod. Fadlan diid duubitaanka heesaha iyo kuwa isticmaalaya cod kumbiyuutar lagu farsameeyay oo macmal ah.

source: No
so: Maya

source: [No ‘a’ in the original text]
so: [Maya 'a' qoraalka asalka ah]

source: Offensive language
so: Af xun

source: Offensive speech
so: Hadal aflagaado ah

source: On his head he wore a beret.
so: Madaxiisa waxa uu gashaday koofiyad.

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
so: Dhanka kale, haddii aad u malaynayso in akhristuhu ay u badan tahay in aanu waligiis hore u arag ereyga, oo uuna si khaldan ugu dhawaaqayo, fadlan diid. Haddii aadan hubinna, isticmaal badhanka Skip.

source: Partner
so: Wadaay

source: [Part of the text can’t be heard]
so: [Qayb ka mid ah qoraalka lama maqli karo]

source: Play/Stop
so: Wad/Jooji

source: [‘Raised’ in English is always pronounced as one syllable, not two]
so: ['Raised' Ingiriis ahaan mar walba waxaa loogu dhawaaqaa hal xaraf, ee maaha laba]

source: Reader Effects
so: Saamaynaha akhristaha

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
so: Akhrinta ereyada lasoo gaabiyay oo aan dhab ahaan meesha ku jiran, sida "We're" halkii la oran lahaa "We are", ama lidka.

source: Ready to do { $count } more?
so: Diyaar ma u tahay in aad wax ka badan { $count } sii qabato?

source: [Recording cut off before the end of the last word]
so: [Duubista way go'day ka hor dhamaadka ereyga u dambeeya]

source: Record/Stop
so: Duub/Jooji

source: Record your voice
so: Duub codkaaga

source: Report
so: Ka warbixi

source: Report was passed successfully
so: Warbixinta si guul leh ayaa loo gudbiyay

source: Request a Language
so: Codso Luuqad

source: Re-record clip
so: Dib u duub codka

source: Return
so: Ku noqo

source: Review
so: Dib u eeg

source: Shortcuts
so: Waddo gaaban

source: [Should be ‘dinosaurs’]
so: [Waa inuu noqdaa 'daynasoor']

source: [Should be “We are”]
so: [Waa inay noqotaa "Waxaan nahay"]

source: Skip
so: Ka bood

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
so: <strong>[Jabaq]</strong>Daynasoorrada waaweyn ee<strong>[jabaq]</strong> -riassic.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
so: <strong>[ hindhiso ]</strong>Daynasoorrada waaweyn ee<strong>[qufac]</strong> Triassic.

source: Submit
so: Gudbi

source: Submit a report
so: Gudbi warbixin

source: Submit clips
so: Soo gudbi muuqaallo

source: Success
so: Guul

source: Taking several attempts to read a word.
so: Waxay qaadanaysaa Isku dayo dhowr ah in la akhriyo erey.

source: The clip has disrespectful or offensive language.
so: Codkan waxaa ku jira ixtiraam darro ama af xumo.

source: The giant dinosaur of the Triassic.
so: Daynasoor-ka weyn ee Triassic.

source: The giant dinosaurs of the Triassi-.
so: Daynasoor-ka weyn ee Triassi-.

source: The giant dinosaurs of the Triassic.
so: Daynasoorrada waaweyn ee Triassic.

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
so: Daynasoorrada waaweyn ee Triassic. <strong>[waxaa akhriyey hal cod]</strong>

source: The giant dinosaurs of the Triassic. Yes.
so: Daynasoorrada waaweyn ee Triassic. Haa

source: The giant dino <strong>[cough]</strong> the Triassic.
so: Dino weyn<strong>[qufac]</strong> Triassic.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
so: Waxaa jiri doona kala duwanaansho dabiici ah oo heerka codka ah oo u dhexeeya akhriyayaasha. Diid kaliya haddii heerka codku aad u sarreeyo oo ay duubistu kala go'ayso, ama (inta badan) haddii ay aad u hooseeyso oo aadan maqli karin waxa la sheegayo ilaa adigoon dib u tixraacin qoraalka qoran.

source: The sentence has a grammatical or spelling error.
so: Weedhu waxaa ku jira khalad naxwe ama higaad.

source: The sentence has disrespectful or offensive language.
so: Jumladdan waxaa ku jira ereyo ixtiraam darro ah ama meel ka dhac ah.

source: Understand contribution criteria
so: Faham halbeegyada wax ku biirinta

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
so: Fahan waxa ay tahay in laga eego marka la dhegaysanayso maqaallada codka oo ka caawi in aad duubista codkaaga ka dhigto mid sii fiican!

source: Varying Pronunciations
so: Ku dhawaaqid kala duwan

source: Volume
so: Heerka codka

source: We are going out to get a coffee.
so: Waxaan u baxaynaa inaan qaxwo soo qaadanno.

source: We are going out to get coffee.
so: Waxaan u baxaynaa sii aan kafee usoo cabno.

source: We couldn’t get any sentences for you to speak. Please try again later.
so: Waanu heli kari waynay wax weedho ah oo aad ku hadasho. Fadlan isku day mar kale hadhow.

source: We’re going out to get coffee.
so: Waxaan u baxaynaa si aan kafee usoo qaadanno.

source: We've run out of sentences to record in this language...
so: Waxaa naga dhammaaday weedhaha aynu ku diiwaan galin lahayn luqaddan...

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
so: Waxaan rabnaa algorithms-ka barashada mashiinka macmalka ah inuu awood u yeesho inuu xakameeyo guuxa iyo dhawaaqyada gadaal ee kala duwan, iyo xitaa in qaylada dheer la aqbali karo waa haddii aysan kaa joojineynin inaad maqasho maqaalka oo dhan. Muusiga daggan waa OK; balse maya muusig sawaxankiisu kaa horistaagaya inaad maqasho eray kasta.

source: What issues are you experiencing with this sentence?
so: Maxay yihiin caqbabadaha aad kala kulmeyso jumladan?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
so: Markaad dhegaysanayso, si taxaddar leh u hubi in waxa la duubay ay yihiin wixii la qoray; diid haddii ay jiraan xitaa khaladaad yaryar. <br /> Khaladaadka u badan waxaa ka mid ah:

source: Yes
so: Haa

source: You’re contributing to a target segment
so: Waxaad wax ku biirinaysaa qayb bartilmaameed ah

source: You’re contributing to our first target segment
so: Waxaad wax ku biirinaysaa qaybta bartilmaameedkayaga koowaad

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
so: Lahjadda luqaddaada waxaa laga yaabaa inay weedhaha ka dhammaadeen! Haddii aad ku qanacsantahay, waxaad baddali kartaa hagaha "Settings" si aad u aragto jumlado kale oo ku jira luqaddaada.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
so: Waxaad ka caawisay Common Voice inay gaarto <goalPercentage></goalPercentage> yoolkeenna qabashada maalinlaha ah ee { $goalValue }

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
so: Waxaad ka caawisay Common Voice gaaridda <goalPercentage></goalPercentage> yoolkeenna hubinta maalinlaha ah ee { $goalValue }
